[net]
batch=1
subdivisions=1
height=2
width=2
channels=1
learning_rate=0.01
momentum=0.9
policy=poly
max_batches=100

[connected]
sgx=0
output=2
activation=logistic

[connected]
sgx=0
output=1
activation=linear

[cost]
sgx=0
type=sse