[net]
batch=32
subdivisions=1
height=28
width=28
channels=1
learning_rate=0.001
momentum=0.9
policy=poly
max_batches=100

[convolutional]
filters=6
size=5
stride=1
pad=1
sgx=1
activation=relu

[connected]
sgx=1
output=1024
activation=relu

[connected]
sgx=1
output=32
activation=relu

[connected]
sgx=1
output=1
activation=linear

[cost]
sgx=1
type=sse