[net]
batch=256
subdivisions=1
height=28
width=28
channels=1
learning_rate=0.001
momentum=0.9
policy=poly
max_batches=200

[convolutional]
filters=6
size=5
stride=1
pad=2
sgx=1
activation=relu

[maxpool]
size=2
stride=2
padding=0
sgx=1


[convolutional]
filters=16
size=5
stride=1
pad=0
sgx=1
activation=relu

[maxpool]
size=2
stride=2
sgx=1
padding=0

[connected]
sgx=1
output=120
activation=linear

[connected]
sgx=1
output=84
activation=linear

[connected]
sgx=1
output=1
activation=linear

[cost]
sgx=1
type=sse


