[net]
batch=512
subdivisions=1
height=28
width=28
channels=1
learning_rate=0.1
momentum=0.9
policy=poly
max_batches=5
threshold=10


[convolutional]
batch_normalize=1
filters=6
size=5
stride=1
pad=2
sgx=1
activation=relu

[maxpool]
size=2
stride=2
padding=0
sgx=1

[convolutional]
filters=16
size=5
stride=1
pad=0
sgx=1
activation=relu

[maxpool]
size=2
stride=2
sgx=1
padding=0

[connected]
sgx=1
output=128
activation=relu
batch_normalize=0

[dropout]
probability=.5

[connected]
batch_normalize=1
sgx=1
output=32
activation=relu

[connected]
batch_normalize=1
sgx=1
output=10
activation=linear

[cost]
sgx=1
type=ce


