[net]
batch=512
subdivisions=1
height=28
width=28
channels=1
learning_rate=0.001
momentum=0.9
policy=poly
max_batches=10
threshold=10
classes=10

[convolutional]
batch_normalize=0
filters=6
size=5
stride=1
pad=2
sgx=0
activation=relu

[maxpool]
size=2
stride=2
padding=0
sgx=0

[convolutional]
filters=16
size=5
stride=1
pad=0
sgx=0
activation=relu

[maxpool]
size=2
stride=2
sgx=0
padding=0

[connected]
sgx=0
output=128
activation=relu
batch_normalize=1

[dropout]
sgx=0
probability=.5

[connected]
batch_normalize=1
sgx=0
output=32
activation=relu

[connected]
batch_normalize=1
sgx=0
output=10
activation=linear

[cost]
sgx=0
type=ce