[net]
batch=256
subdivisions=1
height=28
width=28
channels=1
learning_rate=0.01
momentum=0.9
policy=poly
max_batches=20
threshold=10

[convolutional]
filters=6
size=5
stride=1
pad=2
sgx=0
activation=relu

[maxpool]
size=2
stride=2
padding=0
sgx=0

[convolutional]
filters=16
size=5
stride=1
pad=0
sgx=0
activation=relu

[maxpool]
size=2
stride=2
sgx=0
padding=0

[connected]
sgx=0
output=128
activation=relu

[connected]
batch_normalize=1
sgx=0
output=32
activation=relu

[connected]
batch_normalize=0
sgx=0
output=1
activation=linear

[cost]
sgx=0
type=sse


